# Pandas week 3

# 9. Membagi Data Frame menjadi dua secara acak

In [ ]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

In [ ]:
#Data Frame Prep
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,25, size=(n_rows, n_cols)),
                 columns=cols)

df

# Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [ ]:
df.shape#menghitung jumlas baris dan kolom (kanan baris dan kiri kolom )

In [ ]:
#membagi data Frame
proporsi= 0.8 #80% data pertama dan sisanya untuk data kedua
df_1 = df.sample(frac=proporsi)
#df.sample(): method yang mengambil baris secara acak sesuai nilai parameter fracnya
df_2 = df.drop(df_1.index)#--> isinya menghapus baris yang sudah ada di df_1 (sisa data dari df_1)

print(f'df_1shape: {df_1.shape}')
print(f'df_2shape: {df_2.shape}')

In [ ]:
# isi df_1
df_1

In [ ]:
#isi df_2
df_2

# 10. Mengganti nama kolom pada Data Frame berdasarkan pola

In [22]:
#import modules
import pandas as pd
import numpy as np 
import os

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [23]:
#Data Frame Prep
cf = pd.read_csv('C:/Users/Markvinson/Visualisasi data/Pandas/data/data/titanicfull.csv') #mengload dataset yang awalnya csv menjadi data Frame
#prep data kali menggunakan dataset titanic, jadi dapat langsung diakses 
cf.columns= ['Pclass', 'Survival Status', 'Full Name','Sex',' Age',
            'Sib SP', 'Parch', 'Ticket','Fare', 'Cabin', 'Embarked']

cf_backup=cf.copy(deep=True)
cf.head()

,Pclass,Survival Status,Full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _

In [26]:
cf.columns= cf.columns.str.replace(' ','_').str.lower() #merubah semua huruf pada kolom menjadi huruf kecil dan mengganti semua spasi dengan _
#str.replace('','_')-->
#str.lower()-->mengubah semua nama kolom menjadi huruf kecil 
#str.upper()-->mengubah semua nama kolom menjadi huruf besar
cf.head()

,_p_c_l_a_s_s_,_s_u_r_v_i_v_a_l___s_t_a_t_u_s_,_f_u_l_l___n_a_m_e_,_s_e_x_,_a_g_e_,_s_i_b___s_p_,_p_a_r_c_h_,_t_i_c_k_e_t_,_f_a_r_e_,_c_a_b_i_n_,_e_m_b_a_r_k_e_d_
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Memangkas kelebihan spasi pada nama kolom

In [28]:
cf=cf_backup.copy(deep=True)
cf.columns = cf.columns.str.lower().str.strip().str.replace(' ','_')
#str.strip()--> memotong kelebihan spasi di sisi kanan dan di sisi kiri
cf.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# 11. Seleksi kolom dan baris pada Data Frame menggunakan loc

In [29]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2